#ifndef __VECTOR2D__H
#define __VECTOR2D__H

//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------ class Vector2D --------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//! Класс Vector2D представляет двухмерный вектор и 
//! методы для работы с ним.
/*! */
//------------------------------------------------------------------------------
class Vector2D
{
public:
	Vector2D();
	//! Конструктор класса, принимающий параметры: x координата и y координата
	Vector2D( double x, double y );
	//! Конструктор копирования
	Vector2D( const Vector2D& other );
	//! Оператор присваивания
	Vector2D& operator = ( const Vector2D& other );

	//! Оператор неравно, возвращает true если текущий объект не равен other
	bool operator != ( const Vector2D& other ) const;
	//! Оператор равно, возвращает true если текущий объект равен other
	bool operator == ( const Vector2D& other ) const;
	//! Оператор меньше, возвращает true если текущий объект меньше other
	/*! Сначала вектора сравниваются по x, потом по y. */
	bool operator < ( const Vector2D& other ) const;
	
	double x;
	double y;
};

#endif