#ifndef __VECTOR4D__H
#define __VECTOR4D__H

#include "vector3d.h"

//------------------------------------------------------------------------------
//------------------------------ class Vector4D --------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//! Класс Vector4D представляет четырехмерный вектор.
//! Выступает как хранилище для некоторых функций.
/*! */
//------------------------------------------------------------------------------
class Vector4D
{
public:
	Vector4D();
	//! Конструктор класса, принимающий параметры: x координата, y координата, z координата и w координата
	Vector4D( const double &x, const double &y, const double &z, const double &w );
	//! Конструктор копирования
	Vector4D( const Vector4D &other );
	//! Получить трехмерную составляющую четырехмерного вектора
	Vector3D xyz( ) const;

	double x;
	double y;
	double z;
	double w;
};


#endif
